import { Horror } from './horror';

describe('Horror book testing', () => {
  let horror: Horror;
  beforeEach(() => {
    horror = new Horror(
      'Дракула',
      'Брем Стокер',
      318,
      'Хоррор',
      'Готичний хоррор'
    );
  });
  //   fit('Створення екземпляру класу', () => {
  //     expect(horror).toBeTruthy();
  //   });
  it('Створення екземпляру класу', () => {
    expect(horror).toBeTruthy();
  });

  it('Створення екземпляру класу з від`ємною кількістю сторінок', () => {
    // expect(() =>
    //   new Horror(
    //     'Дракула.2',
    //     'Брем Стокер',
    //     -318,
    //     'Хоррор',
    //     'Готичний хоррор'
    //   ).toThrow(new Error('Від`ємна кількість сторінок'));

    // expect(() => {
    //   new Horror('Дракула.2', 'Брем Стокер', -318, 'Хоррор', 'Готичний хоррор');
    // }).toThrow(new Error('Від`ємна кількість сторінок'));

    expect(() => {
      new Horror('Дракула.2', 'Брем Стокер', -318, 'Хоррор', 'Готичний хоррор');
    }).toThrowError('pages <=0');
  });
  //   it('Пошук книг кожного жанру з найменшою кількістю сторінок'), () => {

  //   }
  it('Розрахунок кількості сторінок'),
    () => {
      let n = horror.pages;
      expect(horror.getPages()).toBe(n);
    };
});
